

#include "BspTime.h"

volatile int g_Tim2Array[(u16)eTimMax] = {0};



/*******************************************************************************
  * @函数名称: BspTim2Init
  * @函数说明：定时器初始化
  * @输入参数：无
  * @输出参数：无
  * @返回参数：无
  * @历史记录:     
     <作者>    <时间>      <修改记录>
*******************************************************************************/
void BspTim2Init(void)
{
 //开启1ms的定时器以及中断
}
/*******************************************************************************
  * @函数名称：BspTim2Close
  * @函数说明：关闭定时器
  * @输入参数：无
  * @输出参数：无
  * @返回参数：无
  * @历史记录:     
     <作者>    <时间>      <修改记录>
*******************************************************************************/
void BspTim2Close(void)
{
//关闭定时器以及中断
}

/*******************************************************************************
  * @函数名称：TIM2_IRQHandler
  * @函数说明：中断服务函数
  * @输入参数：无
  * @输出参数：无
  * @返回参数：无
  * @历史记录:     
     <作者>    <时间>      <修改记录>
*******************************************************************************/
void SysTick_Handler(void)
{
    u16 i = 0;

    if(SET==1)//如果中断标识位挂起 
    {
        //清除中断标识

        for (i = 0; i < (u16)eTimMax; i++)
        {
            g_Tim2Array[i]++;
        }
    }
}


/********************** END ***************************************************/

